<head>
    <title>Задание №1</title>
</head>

<?php

$productsList = [
    [
        "Ноутбук" => [
            "Диагональ" => "15.6 дюймов",
            "Процессор" => "Intel i5",
            "Оперативная память" => "8ГБ",
            "Хранение" => "512ГБ SSD"
        ]
    ],
    [
        "Смартфон" => [
            "Диагональ" => "6.5 дюймов",
            "Процессор" => "Snapdragon 888",
            "Оперативная память" => "8ГБ",
            "Камера" => "108МП"
        ]
    ],
    [
        "Планшет" => [
            "Диагональ" => "10.2 дюйма",
            "Процессор" => "A12 Bionic",
            "Оперативная память" => "4ГБ",
            "Хранение" => "256ГБ"
        ]
    ],
    [
        "Наушники" => [
            "Тип" => "Беспроводные",
            "Время работы" => "20 часов",
            "Звук" => "Стерео",
            "Вес" => "250 г"
        ]
    ],
    [
        "Умные часы" => [
            "Тип" => "Спортивные",
            "Аккумулятор" => "14 дней",
            "Функции" => "Мониторинг сердечного ритма",
            "Водозащита" => "IP68"
        ]
    ]
];

foreach ($productsList as $product) {
    echo "<ol>";
    foreach ($product as $name => $chars) {
        echo "<li><b>Товар:</b> " . $name . "</li>";
        echo "<ul>";
        foreach ($chars as $key => $value) {
            echo "<li>" . $key . ":" . $value . "</li>";
        }
        echo "</ul>";
    }
    echo "</ol>";
}
